DataProcessors/гз_СведениеГодовыхПлановЗакупок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>гз_СведениеГодовыхПлановЗакупок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГодовойПлан</Name>
					<Comment>Годовой план</Comment>
					<Type>
						<v8:Type>cfg:DocumentObject.гз_ГодовойПлан</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СведениеПЗП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыПлановЗакупок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПланаЗакупок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гз_ВидыПлановЗакупок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/гз_ГодовойПланЗакупок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>гз_ГодовойПланЗакупок</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гз_МестаПоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гз_ВидыПредметовЗакупки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособЗакупки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гз_СпособыЗакупки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПланаЗакупок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гз_ВидыПлановЗакупок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/гз_ПланыЗакупок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>гз_ПланыЗакупок</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гз_МестаПоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гз_ВидыПредметовЗакупки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПланаЗакупок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гз_ВидыПлановЗакупок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/гз_ВидыОперацийДокументовПланированияЗакупок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>гз_ВидыОперацийДокументовПланированияЗакупок</Name>
			<Comment>(гз)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Планирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/гз_СостояниеДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>гз_СостояниеДокумента</Name>
			<Comment>(гз)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Утверждена</Name>
					<Comment>Утверждена</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУтверждена</Name>
					<Comment>Не утверждена</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/гз_ПланЗакупокПодразделения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>гз_ПланЗакупокПодразделения</Name>
			<Comment>План закупок подразделения</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.гз_ПланыЗакупок</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гз_ВидыОперацийДокументовПланированияЗакупок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Регл) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гз_МестаПоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гз_СостояниеДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПланаЗакупок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гз_ВидыПлановЗакупок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставЗаявкиТовары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидКорректировки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.гз_ВидыКорректировокГодовогоПлана</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоПоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гз_МестаПоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодПоставки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыдатьИзОстатков</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/гз_СведениеГодовыхПлановЗакупок/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

//Хранит признак ведения учета исполнения заказов подразделений
Перем ВедениеУчетаИсполнениеПлановЗакупок Экспорт; // экспортная переменная

//Хранит признак ведения учета по видам планов закупок
Перем ВедениеУчетаПоВидамПланов Экспорт; // экспортная переменная

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция определяет вид операции формируемого документа
//
// Параметры:
//  Нет.
// Возвращаемое значение:
//  Значение перечисления - вид операции документа Годовой план
//
Функция ОпределитьВидОперации() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Год", ГодовойПлан.Год);
	Запрос.УстановитьПараметр("Организация", ГодовойПлан.Организация);
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.гз_ВидыОперацийДокументовПланированияЗакупок.Планирование);
	Запрос.УстановитьПараметр("ВидПланаЗакупок", ГодовойПлан.ВидПланаЗакупок);
	Запрос.Текст =  "ВЫБРАТЬ
	                |	гз_ГодовойПланЗакупокОбороты.Регистратор
	                |ИЗ
	                |	РегистрНакопления.гз_ГодовойПланЗакупок.Обороты(
	                |			,
	                |			,
	                |			Регистратор,
	                |			Год = &Год
	                |				И Организация = &Организация
	                |				И ВидПланаЗакупок = &ВидПланаЗакупок) КАК гз_ГодовойПланЗакупокОбороты
	                |ГДЕ
	                |	гз_ГодовойПланЗакупокОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.гз_ВидыОперацийДокументовПланированияЗакупок.Планирование)";
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда 
		Возврат Перечисления.гз_ВидыОперацийДокументовПланированияЗакупок.Корректировка;
	Иначе 
		Возврат Перечисления.гз_ВидыОперацийДокументовПланированияЗакупок.Планирование;
	КонецЕсли;
	
КонецФункции

// Функция формирует запрос для получения таблицы цен номенклатуры
//
// Параметры:
//  МассивНоменклатуры.
//
// Возвращаемое значение:
//  Таблица значений, содержащая колонки Номенклатура и Цена
//  
Функция ПолучитьТаблицуЦенНоменклатуры(МассивНоменклатуры) Экспорт 
	
	Возврат гз_ПроцедурыОперативногоУчетаЗакупок.мПолучитьТаблицуЦенНоменклатуры(МассивНоменклатуры,ГодовойПлан.Организация,ГодовойПлан.Год);
	
КонецФункции //ПолучитьТаблицуЦенНоменклатуры()

// Функция формирует таблицу планов закупок подразделений
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Таблица значений, содержащая планы закупок подразделений
//  
Функция СформироватьТаблицуПлановПодразделений() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Год", ГодовойПлан.Год);
	Запрос.УстановитьПараметр("Организация", ГодовойПлан.Организация);
	Запрос.УстановитьПараметр("СостояниеОтменена", Перечисления.гз_СостояниеДокумента.Отменена);
	Запрос.Текст = "ВЫБРАТЬ
				   |	гз_ПланЗакупокПодразделения.Ссылка,
				   |	гз_ПланЗакупокПодразделения.ПометкаУдаления,
				   |	гз_ПланЗакупокПодразделения.Номер,
				   |	гз_ПланЗакупокПодразделения.Дата,
				   |	гз_ПланЗакупокПодразделения.Проведен,
				   |	гз_ПланЗакупокПодразделения.Автор,
				   |	гз_ПланЗакупокПодразделения.Год,
				   |	гз_ПланЗакупокПодразделения.Комментарий,
				   |	гз_ПланЗакупокПодразделения.Организация,
				   |	гз_ПланЗакупокПодразделения.Ответственный,
				   |	гз_ПланЗакупокПодразделения.ПодразделениеОрганизации,
				   |	гз_ПланЗакупокПодразделения.РучнаяКорректировка,
				   |	гз_ПланЗакупокПодразделения.Состояние,
				   |	гз_ПланЗакупокПодразделения.СоставЗаявкиТовары.(
				   |		Ссылка,
				   |		НомерСтроки,
				   |		Количество,
				   |		Номенклатура,
				   |		ПериодПоставки
				   |	),
				   |	гз_ПланЗакупокПодразделения.Представление,
				   |	гз_ПланЗакупокПодразделения.МоментВремени
				   |ИЗ
				   |	Документ.гз_ПланЗакупокПодразделения КАК гз_ПланЗакупокПодразделения
				   |ГДЕ
				   |	гз_ПланЗакупокПодразделения.Год = &Год
				   |	И гз_ПланЗакупокПодразделения.Организация = &Организация
				   |	И гз_ПланЗакупокПодразделения.Состояние <> &СостояниеОтменена
				   |	И (НЕ гз_ПланЗакупокПодразделения.УчтенаВГодовомПлане)";
				   
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции //СформироватьТаблицуПлановПодразделений()

Процедура ПолучитьСоставГодовогоПлана() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Год",ГодовойПлан.Год);
	Запрос.УстановитьПараметр("Организация",ГодовойПлан.Организация);
	Запрос.УстановитьПараметр("ВидыПлановЗакупок",ВидыПлановЗакупок.ВыгрузитьКолонку("ВидПланаЗакупок"));
	Если ГодовойПлан.ВидОперации = Перечисления.гз_ВидыОперацийДокументовПланированияЗакупок.Планирование Тогда 
		Запрос.Текст = "ВЫБРАТЬ
		               |	гз_ГодовойПланЗакупокОбороты.МестоПоставки,
		               |	гз_ГодовойПланЗакупокОбороты.ВидНоменклатуры,
		               |	гз_ГодовойПланЗакупокОбороты.Номенклатура,
		               |	гз_ГодовойПланЗакупокОбороты.СпособЗакупки,
		               |	гз_ГодовойПланЗакупокОбороты.ПериодПоставки,
		               |	гз_ГодовойПланЗакупокОбороты.КоличествоОборот КАК Количество,
		               |	гз_ГодовойПланЗакупокОбороты.СуммаОборот КАК Сумма,
		               |	гз_ГодовойПланЗакупокОбороты.ПериодПоставки КАК ДатаНачалаПоставки,
		               |	КОНЕЦПЕРИОДА(гз_ГодовойПланЗакупокОбороты.ПериодПоставки, МЕСЯЦ) КАК ДатаОкончанияПоставки,
		               |	ЗНАЧЕНИЕ(перечисление.гз_видыкорректировокГодовогоПлана.Добавление) КАК ВидКорректировки,
		               |	ВЫБОР
		               |		КОГДА гз_ГодовойПланЗакупокОбороты.КоличествоОборот = 0
		               |			ТОГДА 0
		               |		ИНАЧЕ гз_ГодовойПланЗакупокОбороты.СуммаОборот / гз_ГодовойПланЗакупокОбороты.КоличествоОборот
		               |	КОНЕЦ КАК Цена
		               |ИЗ
		               |	РегистрНакопления.гз_ГодовойПланЗакупок.Обороты(
		               |			,
		               |			,
		               |			,
		               |			Год = &Год
		               |				И Организация = &Организация
		               |				И ВидПланаЗакупок В (&ВидыПлановЗакупок)) КАК гз_ГодовойПланЗакупокОбороты";
		ГодовойПлан.СоставЗаявкиТовары.Загрузить(Запрос.Выполнить().Выгрузить());
		Если СведениеПЗП Тогда 
			Запрос.Текст = "ВЫБРАТЬ
			               |	гз_ПланыЗакупокОбороты.Подразделение КАК ПодразделениеОрганизации,
			               |	гз_ПланыЗакупокОбороты.МестоПоставки,
			               |	гз_ПланыЗакупокОбороты.Номенклатура,
			               |	гз_ПланыЗакупокОбороты.ПериодПоставки,
			               |	гз_ПланыЗакупокОбороты.КоличествоОборот КАК Количество
			               |ИЗ
			               |	РегистрНакопления.гз_ПланыЗакупок.Обороты(
			               |			,
			               |			,
			               |			,
			               |			Год = &Год
			               |				И Организация = &Организация
			               |				И ВидПланаЗакупок В (&ВидыПлановЗакупок)) КАК гз_ПланыЗакупокОбороты";
			ГодовойПлан.КорректировкаПлановЗакупок.Загрузить(Запрос.Выполнить().Выгрузить());
		КонецЕсли;
	ИначеЕсли ГодовойПлан.ВидОперации = Перечисления.гз_ВидыОперацийДокументовПланированияЗакупок.Корректировка Тогда 
		Запрос.Текст = "ВЫБРАТЬ
		               |	МАКСИМУМ(гз_ГодовойПланЗакупокОбороты.Период) КАК Период
		               |ИЗ
		               |	РегистрНакопления.гз_ГодовойПланЗакупок.Обороты(
		               |			,
		               |			,
		               |			Регистратор,
		               |			Год = &Год
		               |				И Организация = &Организация
		               |				И ВидПланаЗакупок  = &ВидПланаЗакупок) КАК гз_ГодовойПланЗакупокОбороты";
		Запрос.УстановитьПараметр("ВидПланаЗакупок",ГодовойПлан.ВидПланаЗакупок);
		Выборка = Запрос.Выполнить().Выбрать();
			
		Если Выборка.Следующий() Тогда 
			Период = Выборка.Период;
		КонецЕсли;
				
		Запрос.Текст = "ВЫБРАТЬ
		               |	гз_ГодовойПланЗакупокОбороты.МестоПоставки,
		               |	гз_ГодовойПланЗакупокОбороты.ВидНоменклатуры,
		               |	гз_ГодовойПланЗакупокОбороты.Номенклатура,
		               |	гз_ГодовойПланЗакупокОбороты.СпособЗакупки,
		               |	гз_ГодовойПланЗакупокОбороты.ПериодПоставки,
		               |	гз_ГодовойПланЗакупокОбороты.КоличествоОборот КАК Количество,
		               |	гз_ГодовойПланЗакупокОбороты.СуммаОборот КАК Сумма,
		               |	гз_ГодовойПланЗакупокОбороты.ПериодПоставки КАК ДатаНачалаПоставки,
		               |	КОНЕЦПЕРИОДА(гз_ГодовойПланЗакупокОбороты.ПериодПоставки, МЕСЯЦ) КАК ДатаОкончанияПоставки,
		               |	ЗНАЧЕНИЕ(перечисление.гз_видыкорректировокГодовогоПлана.Добавление) КАК ВидКорректировки,
		               |	ВЫБОР
		               |		КОГДА гз_ГодовойПланЗакупокОбороты.КоличествоОборот = 0
		               |			ТОГДА 0
		               |		ИНАЧЕ гз_ГодовойПланЗакупокОбороты.СуммаОборот / гз_ГодовойПланЗакупокОбороты.КоличествоОборот
		               |	КОНЕЦ КАК Цена
		               |ИЗ
		               |	РегистрНакопления.гз_ГодовойПланЗакупок.Обороты(
		               |			&Период,
		               |			,
		               |			,
		               |			Год = &Год
		               |				И Организация = &Организация
		               |				И ВидПланаЗакупок В (&ВидыПлановЗакупок)) КАК гз_ГодовойПланЗакупокОбороты";

		Запрос.УстановитьПараметр("Период",Период);
		ГодовойПлан.СоставЗаявкиТовары.Загрузить(Запрос.Выполнить().Выгрузить());
		
		Если СведениеПЗП Тогда 
		
			Запрос.Текст = "ВЫБРАТЬ
			               |	гз_ПланыЗакупокОбороты.МестоПоставки,
			               |	гз_ПланыЗакупокОбороты.Номенклатура,
			               |	гз_ПланыЗакупокОбороты.ПериодПоставки,
			               |	гз_ПланыЗакупокОбороты.КоличествоОборот КАК Количество,
			               |	гз_ПланыЗакупокОбороты.Подразделение КАК ПодразделениеОрганизации
			               |ИЗ
			               |	РегистрНакопления.гз_ПланыЗакупок.Обороты(&Период, , ,Год = &Год
			               |				И Организация = &Организация
			               |				И ВидПланаЗакупок В (&ВидыПлановЗакупок)) КАК гз_ПланыЗакупокОбороты";
			ГодовойПлан.КорректировкаПлановЗакупок.Загрузить(Запрос.Выполнить().Выгрузить());
		КонецЕсли;
		
	КонецЕсли;
		
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

ВедениеУчетаПоВидамПланов = Константы.гз_ВестиУчетПоВидамПлановЗакупок.Получить();
ВедениеУчетаИсполнениеПлановЗакупок = Константы.гз_ВестиУчетИсполненияЗаказовПодразделений.Получить();
